{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 96, "b_regularizer": null, "W_regularizer": null, "output_dim": 32, "batch_input_shape": [null, 96]}}]}, {"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "activation": "linear", "input_dtype": "float32", "input_dim": 96, "b_regularizer": null, "W_regularizer": null, "output_dim": 32, "batch_input_shape": [null, 96]}}]}], "name": "merge_1", "concat_axis": -1, "arguments": {}, "mode_type": "raw", "dot_axes": -1, "output_mask_type": "raw", "output_shape_type": "raw", "output_mask": null, "output_shape": null, "mode": "concat"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 64, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 1}}]}